<?php
/**
 * rete y PhpStorm
 * User: Mienen
 * te: 2019/5/9
 * Time: 21:53
 */
$str='1． 1949 年 9 月 21 日， 毛泽东在中国人民政治协商会议第一届全体会议上发
表的开幕词是（  ） 。
《中国革命和中国共产党》
《论人民民主专政》
《中国人民站起来了 》
2． 第一部中华人民共和国宪法颁布于（  ） 年。
 1953   1954   1956
3． 《实践是检验真理的唯一标准》 一文首先发表于下列哪种报纸上（ ）
 人民日报  光明日报  文汇报  解放军报
4． 实现______， 就是中华民族近代以来最伟大的梦想。
 四个现代化
 中华民族伟大复兴
 全面建成小康社会
5． 中国梦的基本内涵是实现______。
 国家富强 民族振兴 人民幸福
 国家强大 民族振兴
 经济发展 社会和谐
6． ______是当代中国发展进步的根本方向， 是实现中国梦的必由之路， 也
是引领我国工人阶级走向更加光明未来的必由之路。
 中国特色社会主义
 民族振兴
 富国强兵
7． ___ ___是中国特色社会主义的根本任务， 所以必须坚持以经济建设为
中心， 以科学发展为主题， 实现以人为本 全面协调可持续的科学发展。
 发展经济
 解放和发展社会生产力
 发展生产
8． 新中国颁布的第一部法律是（ ）
《宪法》  《刑法》  《婚姻法》  《土地改革法》
9． 社会主义制度在中国确立的主要标志是（ ）
 中华人民共和国的成立
 第一个五年计划的完成
 中华人民共和国宪法的颁布 
 三大改造的胜利完成
10． 1953-1956 年我国民主政治建设取得重大进展， 其表现是（  ） 。
 人民代表大会制度建立 
 过渡时期总路线公布 
 全国政协成立
11． 1915 年 9 月 ， 陈独秀在上海创办了（  ） ， 从此拉开了 近代中国第一次思想解放运动——新文化运动的序幕。
 《新青年》   《青年杂志》   《青春》
 
 
12． 1931 年 11 月 ， 第一次全国苏维埃代表大会召开的地点是 （ ） 。
瑞金  兴国   延安
13． 我国第一个五年计划完成于（  ） 。
 大跃进时期 
 全面进行社会主义建设时期 
 社会主义改造时期
14． 第（  ） 届全国人民代表大会提出了 “四个现代化” 的宏伟目标。
 三 
 四 
 五
15． 2008 年 9 月 ， 我国神舟七号载人航天飞行取得圆满成功。 这标志着我国载人航天工程“三步走战略” 的第二步取得突破性进展， 我国由此成为世界上（  ） 独立掌握空间出舱关键技术的国家。
 第二个 
 第三个 
 第四个
16． 中央人民政府正式宣布五月 四日为“青年节” 是在（  ） 年。
 1921
 1949 
 1953
17． 我国第一颗原子弹于 (  ) 爆炸成功。
  1963 年 
  1964 年 
  1965 年 
  1966 年
18． 我国的基本民族政策是 (  )
  实行民族区域自治 
  实现各民族共同繁荣
  民族不分大小一律平等 
  反对大民族主义和地方民族主义
19． 把毛泽东思想确立为我们党的指导思想的会议是 (  ) 。
  党的七大 
  七届二中全会 
  六届七中全会
20  邓小平同志首次提出“解放思想 实事求是” 是在（ ）
  1977 年党的十届三中全会上 
  1978 年中央工作会议上
  1978 年全军政治工作会议上 
  1978 年党的十一届三中全会上
21． 中国改革的第一个突破口 是（ ）
  农村改革 
  城市改革 
  国有企业改革 
  发展个体 私营经济
22． 党的（Ｃ ） 首次使用“邓小平理论” 这个科学称谓。
Ａ 十三大 Ｂ 十四大 Ｃ 十五大 Ｄ 十六大
23． 第一个与新中国建交的西方大国是（  ） ， 对中国加强同西欧的关系起
到了 重要作用。
 英国   德国   法国
24． 恢复中华人民共和国在联合国的合法席位是在（  ） 年。
 1970    1971    1972
25． 第一个支持恢复中国在联合国合法席位 第一个就中国加入世贸组织与
中方签署双边协议的拉美国家是（  ） 。
 巴西   智利   古巴
26． 新中国外交政策成熟的标志是（  ）
 1953 年提出的和平共处五项原则 
 1955 年提出的“求同存异” 方针
 1970 年代形成的关于三个世界划分的理论
27． 1979 年 1 月 1 日， 中国与（  ） 互相承认并建立大使级外交关系， 从
而结束了 两国关系的长期不正常状态。
 美国  日本  加拿大
28． 1984 年 5 月 召开的（  ） 正式批准了 “一国两制” 的构想， 标志着这一科学思想正式成为和平统一祖国的基本国策。
 六届人大二次会议 
 六届人大三次会议 
 十二届三中全会
29． 1997 年（  ） ， 我国恢复行使对香港的主权， 标志着“一国两制” 构
想的巨大成功， 标志着中国人民在完成祖国统一大业道路上迈出了 重要的一步。
 6 月 1 日 
 7 月 1 日 
 8 月 1 日
30． （  ） 年 1 月 21 日， 第六届全国人大第九次会议正式通过国务院关于建立教师节的议案， 并决定 9 月 10 日为我国的教师节。
 1984   1985   1986
31． 1986 年 3 月 3 日， 王大珩等四位科学家给中共中央写信， 提出要跟踪世界先进水平， 发展我国高技术的建议。 （  ） 当即批示“此事宜速作决断。 不可拖延” 。 后来， 中共中央 国务院批准了 《高技术研究发展计划（“863” 计划） 纲要》 。
 胡耀邦  邓小平  陈云
32． 2001 年 12 月 11 日， 中国正式加入世界贸易组织（WTO） ， 成为第（  ）个成员。
 133 
 143
  153
33． 系统阐述社会主义初级阶段理论的会议是（  ） 。
 党的十二大 
 党的十二届六中全会 
 党的十三大
34． 党的（  ） 明确指出： “我国经济体制改革的目 标是建立社会主义市场经济体制” 。
 十三大 
 十三届六中全会 
 十四大
35． 1997 年 9 月 ， 党的十五大把邓小平理论确立为党的（  ） 并写进党章。
 指导方针 
 指导思想 
 战略思想
36． 2002 年 11 月 ， 党的十六大提出全面建设（  ） 的奋斗目 标， 把“三个代表” 重要思想同马克思列宁主义 毛泽东思想 邓小平理论一道确立为党必须长期坚持的指导思想。
 小康社会 
 法治社会 
 和谐社会
37． 1971 年毛泽东 周恩来邀请美国一球队的队员访华， 展开了 著名的（）
 篮球外交
 足球外交
 乒乓外交
 网球外交
38． 1971 年 10 月 25 日， 在美国纽约联合国总部举行的第 () 届联大会上，
恢复新中国在联大的合法席位和驱逐台湾当局代表的提案， 以压倒多数被通过。
 25
 26
 27
 28
39． 十九大的主题是：不忘初心，（），高举中国特色社会主义伟大旗帜，决胜全面建成小康社会，夺取新时代中国特色社会主义伟大胜利，为实现中华民族伟大复兴的中国梦不懈奋斗。
继续向前  
牢记使命  
方得始终  
砥砺前行
40． 文革后恢复高考的第一次考试， 有 570 万名考生走进了 考场， 考试的时
间为()
 1977 年夏
 1977 年秋
 1977 年冬
 1978 年春
41． 1982 年 9 月 ， 邓小平会见当时英国首相时， 公开提出了“一国两制” 的
构想。 这位首相的名字是()
 梅 杰
 撒切尔夫人
 布莱尔
 希 思
42． 中国加入世贸组织（WTO） 的时间是()
 2002 年
 2001 年
 2000年
 1999 年
43． 2008 年， 中国体育代表团在 29 届北京奥运会上， 获得 （  ） 枚
金牌， 名列奖牌榜（ ） 。
 51， 第一名
 41， 第二名
 31， 第三名
 21， 第四名
44． 1984 年 5 月 召开的（  ） 正式批准了 “一国两制” 的构想， 标志着这
一科学思想正式成为和平统一祖国的基本国策。
 六届人大二次会议  六届人大三次会议  十二届三中全会
45． 1997 年（  ） ， 我国恢复行使对香港的主权， 标志着“一国两制” 构
想的巨大成功， 标志着中国人民在完成祖国统一大业道路上迈出了 重要的一步。
 6 月 1 日  
 7 月 1 日  
 8 月 1 日
46． （  ） 年 1 月 21 日， 第六届全国人大第九次会议正式通过国务院关于建立教师节的议案， 并决定 9 月 10 日为我国的教师节。
 1984    1985    1986
47． 系统阐述社会主义初级阶段理论的会议是（  ） 。
 党的十二大 
 党的十二届六中全会 
 党的十三大
48． 党的（  ） 明确指出： “我国经济体制改革的目 标是建立社会主义市场经济体制” 。
 十三大 
 十三届六中全会 
 十四大
49． 邓小平指的第一生产力指的是（）
 指导方针 
 指导思想 
 战略思想 
 科学技术
50． 被国际奥委会主席称为“一届真正的无与伦比的奥运会” 的是（  ） 。
 北京奥运会 
 悉尼奥运会 
 汉城奥运会
';
$str = preg_replace('/\d+\．/',';',$str);
$arr = explode(';',trim($str,';'));
$new=[];
foreach ($arr as $key=>&$v){
    $newstrArr = explode("。",$v);
    $map['title'] = $newstrArr[0];
    if(explode("\r\n",$newstrArr[1])){
        $newlist =(array_filter(explode("\r\n",$newstrArr[1])));
    }else{
        $newlist =(array_filter(explode("",$newstrArr[1])));
    }
    sort($newlist);
    $map['list'] =$newlist;
    $new[]=$map;
}
echo '<pre>';
print_r($new);
echo '';
die;

echo json_encode($new);die;
var_dump($arr);